nc: 1 #$#人员检测时为1，普通检测时为80 number of classes
state_classes: 6  # 状态类别数
scales: # model compound scaling constants, i.e. 'model=yolov13n.yaml' will call yolov13.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]   # Nano
  s: [0.50, 0.50, 1024]   # Small
  l: [1.00, 1.00, 512]    # Large
  x: [1.00, 1.50, 512]    # Extra Large

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 2, DSC3k2_CBAM,  [256, False, 0.25]]
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 2, DSC3k2_CBAM,  [512, False, 0.25]]
  - [-1, 1, DSConv,  [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, DSConv,  [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

head:
  - [[2, 4, 6, 8], 2, HyperACE, [512, 8, True, True, 0.5, 1, "both"]] #9 H4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  #10 H3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   #11 H2 #添加改变序号
  - [ 9, 1, DownsampleConv, []] #12 H5
  - [[6, 9], 1, FullPAD_Tunnel, []]  #13     
  - [[4, 10], 1, FullPAD_Tunnel, []]  #14 
  - [11, 1, Conv, [256, 1, 1]]  #15
  - [[2, -1], 1, FullPAD_Tunnel, []]  #16      #添加改变序号
  - [[8, 12], 1, FullPAD_Tunnel, []] #17 
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  #18
  - [[-1, 13], 1, Concat, [1]] #19  cat backbone P4
  - [-1, 2, DSC3k2_CBAM, [512, True]] # 20
  - [[-1, 9], 1, FullPAD_Tunnel, []]  #21

  - [20, 1, nn.Upsample, [None, 2, "nearest"]]  #22
  - [[-1, 14], 1, Concat, [1]] # 23 - cat backbone P3
  - [-1, 2, DSC3k2_CBAM, [256, True]] # 24
  - [10, 1, Conv, [256, 1, 1]] # 25
  - [[24, 25], 1, FullPAD_Tunnel, []]  #26
  
  # ========== 新增：P2路径 ==========
  - [24, 1, nn.Upsample, [None, 2, "nearest"]] # 27 
  #- [2, 1, Conv, [128, 1, 1]] # 27 
  - [[-1, 16], 1, Concat, [1]] # 28 
  - [-1, 2, DSC3k2_CBAM, [128, True]] # 29 
  - [15, 1, Conv, [128, 1, 1]] # 30
  - [[29, 30], 1, FullPAD_Tunnel, []] # 31 
  
  # ========== 下采样路径：P2 → P3 ==========
  - [-1, 1, Conv, [256, 3, 2]] # 32 
  - [[-1, 26], 1, Concat, [1]] # 33
  - [-1, 2, DSC3k2_CBAM, [256, True]] # 34 
  - [10, 1, Conv, [256, 1, 1]] # 35 
  - [[34, 35], 1, FullPAD_Tunnel, []] # 36 

  # ========== 下采样路径：P3 → P4 ==========
  - [-1, 1, Conv, [512, 3, 2]] # 37 
  - [[-1, 21], 1, Concat, [1]] # 38 
  - [-1, 2, DSC3k2_CBAM, [512, True]] # 39
  - [[-1, 9], 1, FullPAD_Tunnel, []] # 40 

  # ========== 下采样路径：P4 → P5 ==========
  - [-1, 1, Conv, [512, 3, 2]] # 41 
  - [[-1, 17], 1, Concat, [1]] # 42 
  - [-1, 2, DSC3k2_CBAM, [1024, True]] # 43 
  - [[-1, 12], 1, FullPAD_Tunnel, []] # 44 
  
  # ========== JDE头：包含P2, P3, P4, P5四个检测层 ==========
  - [[31, 36, 40, 44], 1, JDE, [nc, 256, 6]] # JDE(P2, P3, P4, P5)
  # 索引说明：
  # 29 = P2/4-xsmall检测层（128通道，DSC3k2处理后）
  # 34 = P3/8-small检测层（256通道，经过P2→P3下采样路径增强，DSC3k2处理后）
  # 38 = P4/16-medium检测层（512通道，经过P3→P4下采样路径增强，DSC3k2处理后）
  # 42 = P5/32-large检测层（1024通道，经过P4→P5下采样路径增强，DSC3k2处理后）

# 状态预测配置
state_prediction:
  enabled: true
  #classes: ["standing", "sitting", "lying", "running", "walking"]
  loss_weight: 1.0

#后面为person_search专门添加的参数 Additional ReID configuration for person search
reid:
  enabled: true
  embedding_dim: 256
  feature_layer: 8  # Use features from backbone layer 8 (A2C2f layer)
  loss_weight: 0.5  # Weight for ReID loss
  triplet_margin: 0.3  # Margin for triplet loss

